// pages/list/list.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    id:'',
    listData:[],
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    console.log(options.aid)
    const ml = [
      {
        "title": "以史为鉴：前端开发的四个时代",
        "xcid": "10",
        "id": "100"
      },
      {
        "title": "似水流年：企业管理系统的前世今生",
        "xcid": "10",
        "id": "101"
      },
      {
        "title": "实战篇 01：开发前准备",
        "xcid": "10",
        "id": "102"
      },
      {
        "title": "实战篇 02：项目脚手架",
        "xcid": "10",
        "id": "103"
      },
      {
        "title": "实战篇 03：页面布局方案",
        "xcid": "10",
        "id": "104"
      },
      {
        "title": "实战篇 04：权限管理机制",
        "xcid": "10",
        "id": "105"
      },
      {
        "title": "实战篇 05：菜单匹配逻辑",
        "xcid": "10",
        "id": "106"
      },
      {
        "title": "实战篇 06：消息通知设计",
        "xcid": "10",
        "id": "107"
      },
      {
        "title": "实战篇 07：多语言支持",
        "xcid": "10",
        "id": "108"
      },
      {
        "title": "继往开来：可视化页面搭建工具",
        "xcid": "10",
        "id": "109"
      },
      {
        "title": "总结",
        "xcid": "10",
        "id": "110"
      },
      {
        "title": "开篇：Vue CLI 3 项目构建基础",
        "xcid": "11",
        "id": "111"
      },
      {
        "title": "构建基础篇 1：你需要了解的包管理工具与配置项",
        "xcid": "11",
        "id": "112"
      },
      {
        "title": "构建基础篇 2：webpack 在 CLI 3 中的应用",
        "xcid": "11",
        "id": "113"
      },
      {
        "title": "构建基础篇 3：env 文件与环境设置",
        "xcid": "11",
        "id": "114"
      },
      {
        "title": "构建实战篇 1：单页应用的基本配置",
        "xcid": "11",
        "id": "115"
      },
      {
        "title": "构建实战篇 2：使用 pages 构建多页应用",
        "xcid": "11",
        "id": "116"
      },
      {
        "title": "构建实战篇 3：多页路由与模板解析",
        "xcid": "11",
        "id": "117"
      },
      {
        "title": "构建实战篇 4：项目整合与优化",
        "xcid": "11",
        "id": "118"
      },
      {
        "title": "开发指南篇 1：从编码技巧与规范开始",
        "xcid": "11",
        "id": "119"
      },
      {
        "title": "开发指南篇 2：学会编写可复用性模块",
        "xcid": "11",
        "id": "120"
      },
      {
        "title": "开发指南篇 3：合理划分容器组件与展示组件",
        "xcid": "11",
        "id": "121"
      },
      {
        "title": "开发指南篇 4：数据驱动与拼图游戏",
        "xcid": "11",
        "id": "122"
      },
      {
        "title": "开发指南篇 5：Vue API 盲点解析",
        "xcid": "11",
        "id": "123"
      },
      {
        "title": "开发拓展篇 1：扩充你的开发工具",
        "xcid": "11",
        "id": "124"
      },
      {
        "title": "开发拓展篇 2：将 UI 界面交给第三方库",
        "xcid": "11",
        "id": "125"
      },
      {
        "title": "开发拓展篇 3：尝试使用外部数据",
        "xcid": "11",
        "id": "126"
      },
      {
        "title": "总结篇：写在最后",
        "xcid": "11",
        "id": "127"
      },
      {
        "title": "以史为鉴：前端开发的四个时代",
        "xcid": "10",
        "id": "150"
      },
      {
        "title": "1 小册食用指南",
        "xcid": "1",
        "id": "301"
      },
      {
        "title": "2 JS 基础知识点及常考面试题（一）",
        "xcid": "1",
        "id": "302"
      },
      {
        "title": "3 JS 基础知识点及常考面试题（二）",
        "xcid": "1",
        "id": "303"
      },
      {
        "title": "4 ES6 知识点及常考面试题",
        "xcid": "1",
        "id": "304"
      },
      {
        "title": "5 JS 异步编程及常考面试题",
        "xcid": "1",
        "id": "305"
      },
      {
        "title": "6 手写 Promise",
        "xcid": "1",
        "id": "306"
      },
      {
        "title": "Event Loop",
        "xcid": "1",
        "id": "307"
      },
      {
        "title": "JS 进阶知识点及常考面试题",
        "xcid": "1",
        "id": "308"
      },
      {
        "title": "JS 思考题",
        "xcid": "1",
        "id": "309"
      },
      {
        "title": "DevTools Tips",
        "xcid": "1",
        "id": "310"
      },
      {
        "title": "浏览器基础知识点及常考面试题",
        "xcid": "1",
        "id": "311"
      },
      {
        "title": "浏览器缓存机制",
        "xcid": "1",
        "id": "312"
      },
      {
        "title": "浏览器渲染原理",
        "xcid": "1",
        "id": "313"
      },
      {
        "title": "安全防范知识点",
        "xcid": "1",
        "id": "314"
      },
      {
        "title": "从 V8 中看 JS 性能优化",
        "xcid": "1",
        "id": "315"
      },
      {
        "title": "性能优化琐碎事",
        "xcid": "1",
        "id": "316"
      },
      {
        "title": "Webpack 性能优化",
        "xcid": "1",
        "id": "317"
      },
      {
        "title": "实现小型打包工具",
        "xcid": "1",
        "id": "318"
      },
      {
        "title": "React 和 Vue 两大框架之间的相爱相杀",
        "xcid": "1",
        "id": "319"
      },
      {
        "title": "Vue 常考基础知识点",
        "xcid": "1",
        "id": "320"
      },
      {
        "title": "Vue 常考进阶知识点",
        "xcid": "1",
        "id": "321"
      },
      {
        "title": "React 常考基础知识点",
        "xcid": "1",
        "id": "322"
      },
      {
        "title": "React 常考进阶知识点",
        "xcid": "1",
        "id": "323"
      },
      {
        "title": "监控",
        "xcid": "1",
        "id": "324"
      },
      {
        "title": "UDP",
        "xcid": "1",
        "id": "325"
      },
      {
        "title": "TCP",
        "xcid": "1",
        "id": "326"
      },
      {
        "title": "HTTP 及 TLS",
        "xcid": "1",
        "id": "327"
      },
      {
        "title": "HTTP 2 及 HTTP 3",
        "xcid": "1",
        "id": "328"
      },
      {
        "title": "输入 URL 到页面渲染的整个流程",
        "xcid": "1",
        "id": "329"
      },
      {
        "title": "设计模式",
        "xcid": "1",
        "id": "330"
      },
      {
        "title": "常见数据结构",
        "xcid": "1",
        "id": "331"
      },
      {
        "title": "常考算法题解析",
        "xcid": "1",
        "id": "332"
      },
      {
        "title": "CSS 常考面试题资料",
        "xcid": "1",
        "id": "333"
      },
      {
        "title": "如何写好一封简历",
        "xcid": "1",
        "id": "334"
      },
      {
        "title": "面试常用技巧",
        "xcid": "1",
        "id": "335"
      },
      {
        "title": "前方的路，让我们结伴同行",
        "xcid": "1",
        "id": "336"
      },
      {
        "title": "开篇：知识体系与小册格局",
        "xcid": "2",
        "id": "350"
      },
      {
        "title": "网络篇 1：webpack 性能调优与 Gzip 原理",
        "xcid": "2",
        "id": "351"
      },
      {
        "title": "网络篇 2：图片优化——质量与性能的博弈",
        "xcid": "2",
        "id": "352"
      },
      {
        "title": "存储篇 1：浏览器缓存机制介绍与缓存策略剖析",
        "xcid": "2",
        "id": "353"
      },
      {
        "title": "存储篇 2：本地存储——从 Cookie 到 Web Storage、IndexDB",
        "xcid": "2",
        "id": "354"
      },
      {
        "title": "彩蛋篇：CDN 的缓存与回源机制解析",
        "xcid": "2",
        "id": "355"
      },
      {
        "title": "渲染篇 1：服务端渲染的探索与实践",
        "xcid": "2",
        "id": "356"
      },
      {
        "title": "渲染篇 2：知己知彼——解锁浏览器背后的运行机制",
        "xcid": "2",
        "id": "357"
      },
      {
        "title": "渲染篇 3：对症下药——DOM 优化原理与基本实践",
        "xcid": "2",
        "id": "358"
      },
      {
        "title": "渲染篇 4：千方百计——Event Loop 与异步更新策略",
        "xcid": "2",
        "id": "359"
      },
      {
        "title": "渲染篇 5：最后一击——回流（Reflow）与重绘（Repaint）",
        "xcid": "2",
        "id": "360"
      },
      {
        "title": "应用篇 1：优化首屏体验——Lazy-Load 初探",
        "xcid": "2",
        "id": "361"
      },
      {
        "title": "应用篇 2：事件的节流（throttle）与防抖（debounce）",
        "xcid": "2",
        "id": "362"
      },
      {
        "title": "性能监测篇：Performance、LightHouse 与性能 API",
        "xcid": "2",
        "id": "363"
      },
      {
        "title": "前方的路：希望以此为你的起点",
        "xcid": "2",
        "id": "364"
      },
      {
        "title": "什么是 Canvas ",
        "xcid": "7",
        "id": "381"
      },
      {
        "title": "Canvas 的应用场景",
        "xcid": "7",
        "id": "382"
      },
      {
        "title": "手摸手带你入门 Canvas",
        "xcid": "7",
        "id": "383"
      },
      {
        "title": "炫酷背景特效的通性",
        "xcid": "7",
        "id": "384"
      },
      {
        "title": "怎么实现随机粒子",
        "xcid": "7",
        "id": "385"
      },
      {
        "title": "使你的随机粒子动起来",
        "xcid": "7",
        "id": "386"
      },
      {
        "title": "使你的鼠标和屏幕互动",
        "xcid": "7",
        "id": "387"
      },
      {
        "title": "制作属于你自己的特效",
        "xcid": "7",
        "id": "388"
      },
      {
        "title": "使你的 Canvas 更加优雅",
        "xcid": "7",
        "id": "389"
      },
      {
        "title": "webpack 的概念和基础使用",
        "xcid": "3",
        "id": "401"
      },
      {
        "title": "搭建基本的前端开发环境",
        "xcid": "3",
        "id": "402"
      },
      {
        "title": "webpack 如何解析代码模块路径",
        "xcid": "3",
        "id": "403"
      },
      {
        "title": "配置 loader",
        "xcid": "3",
        "id": "404"
      },
      {
        "title": "使用 plugin",
        "xcid": "3",
        "id": "405"
      },
      {
        "title": "更好地使用 webpack-dev-server",
        "xcid": "3",
        "id": "406"
      },
      {
        "title": "开发和生产环境的构建配置差异",
        "xcid": "3",
        "id": "407"
      },
      {
        "title": "用 HMR 提高开发效率",
        "xcid": "3",
        "id": "408"
      },
      {
        "title": "优化前端资源加载 1 - 图片加载优化和代码压缩",
        "xcid": "3",
        "id": "410"
      },
      {
        "title": "优化前端资源加载 2 - 分离代码文件",
        "xcid": "3",
        "id": "411"
      },
      {
        "title": "优化前端资源加载 3 - 进一步控制 JS 大小",
        "xcid": "3",
        "id": "412"
      },
      {
        "title": "提升 webpack 的构建速度",
        "xcid": "3",
        "id": "413"
      },
      {
        "title": "探究 webpack 内部工作流程",
        "xcid": "3",
        "id": "414"
      },
      {
        "title": "创建自己的 loader",
        "xcid": "3",
        "id": "415"
      },
      {
        "title": "创建自己的 plugin",
        "xcid": "3",
        "id": "416"
      },
      {
        "title": "总结",
        "xcid": "3",
        "id": "417"
      },
      {
        "title": "大厂 H5 开发概述",
        "xcid": "4",
        "id": "420"
      },
      {
        "title": "基础页面开发",
        "xcid": "4",
        "id": "421"
      },
      {
        "title": "响应式页面开发",
        "xcid": "4",
        "id": "422"
      },
      {
        "title": "滑屏应用开发",
        "xcid": "4",
        "id": "423"
      },
      {
        "title": "动效开发 1：让它动起来",
        "xcid": "4",
        "id": "424"
      },
      {
        "title": "动效开发 2：聊一聊 3D",
        "xcid": "4",
        "id": "425"
      },
      {
        "title": "动效开发 3：补间动画",
        "xcid": "4",
        "id": "426"
      },
      {
        "title": "动效开发 4：逐帧动画",
        "xcid": "4",
        "id": "427"
      },
      {
        "title": "动效开发 5：SVG 动画",
        "xcid": "4",
        "id": "428"
      },
      {
        "title": "动效开发 6：动效之效",
        "xcid": "4",
        "id": "429"
      },
      {
        "title": "总结",
        "xcid": "4",
        "id": "430"
      },
      {
        "title": "Vuejs 运行机制全局概览",
        "xcid": "6",
        "id": "450"
      },
      {
        "title": "响应式系统的基本原理",
        "xcid": "6",
        "id": "451"
      },
      {
        "title": "响应式系统的依赖收集追踪原理",
        "xcid": "6",
        "id": "452"
      },
      {
        "title": "实现 Virtual DOM 下的一个 VNode 节点",
        "xcid": "6",
        "id": "453"
      },
      {
        "title": "template 模板是怎样通过 Compile 编译的",
        "xcid": "6",
        "id": "454"
      },
      {
        "title": "数据状态更新时的差异 diff 及 patch 机制",
        "xcid": "6",
        "id": "455"
      },
      {
        "title": "批量异步更新策略及 nextTick 原理",
        "xcid": "6",
        "id": "456"
      },
      {
        "title": "Vuex 状态管理的工作原理",
        "xcid": "6",
        "id": "457"
      },
      {
        "title": "总结 & 常见问题解答",
        "xcid": "6",
        "id": "458"
      },
      {
        "title": "基于 JavaScript 的数据应用开发概述",
        "xcid": "5",
        "id": "470"
      },
      {
        "title": "基本数据处理字符串和数字",
        "xcid": "5",
        "id": "471"
      },
      {
        "title": "基本数据处理对象字面量",
        "xcid": "5",
        "id": "472"
      },
      {
        "title": "基本数据处理数组",
        "xcid": "5",
        "id": "473"
      },
      {
        "title": "基本数据处理基本统计",
        "xcid": "5",
        "id": "474"
      },
      {
        "title": "复杂数据处理使用序列(1)",
        "xcid": "5",
        "id": "475"
      },
      {
        "title": "复杂数据处理树形",
        "xcid": "5",
        "id": "476"
      },
      {
        "title": "复杂数据处理结构转换（上）",
        "xcid": "5",
        "id": "478"
      },
      {
        "title": "复杂数据处理结构转换（下）",
        "xcid": "5",
        "id": "479"
      },
      {
        "title": "基于ECharts 的基础表达性统计图表 · 散点图与折线图",
        "xcid": "5",
        "id": "480"
      },
      {
        "title": "基于ECharts 的基础表达性统计图表 · 柱状图与饼图",
        "xcid": "5",
        "id": "481"
      },
      {
        "title": "复杂数据图表箱线图",
        "xcid": "5",
        "id": "482"
      },
      {
        "title": "复杂数据图表关系图谱",
        "xcid": "5",
        "id": "483"
      },
      {
        "title": "复杂数据处理关系图谱",
        "xcid": "5",
        "id": "484"
      },
      {
        "title": "复杂数据图表树形图",
        "xcid": "5",
        "id": "485"
      },
      {
        "title": "数据分析师的好帮手辅助线",
        "xcid": "5",
        "id": "486"
      },
      {
        "title": "更高维度的数据可视化图表",
        "xcid": "5",
        "id": "487"
      },
      {
        "title": "动态数据应用用数据流概念重新理解数据转换",
        "xcid": "5",
        "id": "488"
      },
      {
        "title": "动态数据应用使用 Vuejs 为数据流添加动态转换过滤器",
        "xcid": "5",
        "id": "489"
      },
      {
        "title": "动态数据应用应用高大上的动态数据流（上）",
        "xcid": "5",
        "id": "490"
      },
      {
        "title": "动态数据应用应用高大上的动态数据流（下）",
        "xcid": "5",
        "id": "491"
      },
      {
        "title": "什么是版本控制系统（VCS）",
        "xcid": "16",
        "id": "500"
      },
      {
        "title": "什么是分布式版本控制系统（DVCS)",
        "xcid": "16",
        "id": "501"
      },
      {
        "title": "上手 1：新公司用 Git 管理代码，怎么快速上手？",
        "xcid": "16",
        "id": "502"
      },
      {
        "title": "上手 2：团队工作的基本工作模型",
        "xcid": "16",
        "id": "503"
      },
      {
        "title": "进阶 1：HEAD、master 与 branch",
        "xcid": "16",
        "id": "504"
      },
      {
        "title": "进阶 2：push 的本质",
        "xcid": "16",
        "id": "505"
      },
      {
        "title": "进阶 3：merge：合并 commits",
        "xcid": "16",
        "id": "506"
      },
      {
        "title": "进阶 4：Feature Branching：最流行的工作流",
        "xcid": "16",
        "id": "507"
      },
      {
        "title": "进阶 5：关于 add",
        "xcid": "16",
        "id": "508"
      },
      {
        "title": "进阶 6：看看我都改了什么",
        "xcid": "16",
        "id": "509"
      },
      {
        "title": "高级 1：不喜欢 merge 的分叉？用 rebase 吧",
        "xcid": "16",
        "id": "510"
      },
      {
        "title": "高级 2：刚刚提交的代码，发现写错了怎么办？",
        "xcid": "16",
        "id": "511"
      },
      {
        "title": "高级 3：写错的不是最新的提交，而是倒数第二个？",
        "xcid": "16",
        "id": "512"
      },
      {
        "title": "高级 4：比错还错，想直接丢弃刚写的提交？",
        "xcid": "16",
        "id": "513"
      },
      {
        "title": "高级 5：想丢弃的也不是最新的提交？",
        "xcid": "16",
        "id": "514"
      },
      {
        "title": "高级 6：代码已经 push 上去了才发现写错？",
        "xcid": "16",
        "id": "517"
      },
      {
        "title": "高级 7：reset 的本质——不止可以撤销提交",
        "xcid": "16",
        "id": "518"
      },
      {
        "title": "高级 8：checkout 的本质",
        "xcid": "16",
        "id": "519"
      },
      {
        "title": "高级 9：紧急情况：「立即给我打个包，现在马上！」",
        "xcid": "16",
        "id": "520"
      },
      {
        "title": "高级 10：branch 删过了才想起来有用？",
        "xcid": "16",
        "id": "521"
      },
      {
        "title": "额外说点：gitignore——排除不想被管理的文件和目录",
        "xcid": "16",
        "id": "522"
      },
      {
        "title": "总结",
        "xcid": "16",
        "id": "523"
      },
      {
        "title": "React 的设计思想",
        "xcid": "15",
        "id": "550"
      },
      {
        "title": "组件实践（1）如何定义清晰可维护的接口",
        "xcid": "15",
        "id": "551"
      },
      {
        "title": "组件实践（2）组件的内部实现",
        "xcid": "15",
        "id": "552"
      },
      {
        "title": "组件实践（3）组件化样式",
        "xcid": "15",
        "id": "553"
      },
      {
        "title": "组件设计模式（1）聪明组件和傻瓜组件",
        "xcid": "15",
        "id": "554"
      },
      {
        "title": "组件设计模式（2）高阶组件",
        "xcid": "15",
        "id": "555"
      },
      {
        "title": "组件设计模式（3）render props 模式",
        "xcid": "15",
        "id": "556"
      },
      {
        "title": "组件设计模式（4）提供者模式",
        "xcid": "15",
        "id": "557"
      },
      {
        "title": "组件设计模式（5）组合组件",
        "xcid": "15",
        "id": "558"
      },
      {
        "title": "React 单元测试",
        "xcid": "15",
        "id": "559"
      },
      {
        "title": "React 状态管理（1）组件状态",
        "xcid": "15",
        "id": "560"
      },
      {
        "title": "React 状态管理（2）Redux 使用模式",
        "xcid": "15",
        "id": "561"
      },
      {
        "title": "React 状态管理（3）Mobx  使用模式",
        "xcid": "15",
        "id": "562"
      },
      {
        "title": "React 状态管理（4）不同方式对比",
        "xcid": "15",
        "id": "563"
      },
      {
        "title": "路由的魔法：React Router",
        "xcid": "15",
        "id": "564"
      },
      {
        "title": "服务器端渲染（1）基本套路",
        "xcid": "15",
        "id": "565"
      },
      {
        "title": "服务器端渲染（2）理解 Nextjs",
        "xcid": "15",
        "id": "566"
      },
      {
        "title": "React 的未来（1）拥抱异步渲染",
        "xcid": "15",
        "id": "567"
      },
      {
        "title": "React 的未来（2）Suspense 带来的异步操作革命",
        "xcid": "15",
        "id": "568"
      },
      {
        "title": "React 的未来（3）函数化的 Hooks",
        "xcid": "15",
        "id": "569"
      },
      {
        "title": "结语",
        "xcid": "15",
        "id": "570"
      },
      {
        "title": "开篇：前端多端统一开发背景与趋势介绍",
        "xcid": "14",
        "id": "600"
      },
      {
        "title": "基础篇 1：React 核心语法初识",
        "xcid": "14",
        "id": "601"
      },
      {
        "title": "基础篇 2：微信小程序开发入门与技术选型",
        "xcid": "14",
        "id": "602"
      },
      {
        "title": "基础篇 3：多端统一开发框架 Taro 的安装与使用",
        "xcid": "14",
        "id": "603"
      },
      {
        "title": "基础篇 4：Taro 开发说明与注意事项",
        "xcid": "14",
        "id": "604"
      },
      {
        "title": "基础篇 5：用 Taro 实现一个简单的 Todo 项目",
        "xcid": "14",
        "id": "605"
      },
      {
        "title": "基础篇 6：在 Taro 中使用 Redux",
        "xcid": "14",
        "id": "606"
      },
      {
        "title": "进阶篇 1：Taro 设计思想及架构",
        "xcid": "14",
        "id": "671"
      },
      {
        "title": "进阶篇 2：CLI 原理及不同端的运行机制",
        "xcid": "14",
        "id": "672"
      },
      {
        "title": "进阶篇 3：组件库及 API 的设计与适配",
        "xcid": "14",
        "id": "673"
      },
      {
        "title": "进阶篇 4：JSX 转换微信小程序模板的实现（上）",
        "xcid": "14",
        "id": "674"
      },
      {
        "title": "进阶篇 5：JSX 转换微信小程序模板的实现（下）",
        "xcid": "14",
        "id": "675"
      },
      {
        "title": "进阶篇 6：运行时揭秘 - 小程序运行时",
        "xcid": "14",
        "id": "676"
      },
      {
        "title": "进阶篇 7：运行时揭秘 - H5 运行时",
        "xcid": "14",
        "id": "677"
      },
      {
        "title": "进阶篇 8：运行时揭秘 - RN 运行时 ",
        "xcid": "14",
        "id": "678"
      },
      {
        "title": "实战篇 1：多端电商平台完整项目概述及开发准备",
        "xcid": "14",
        "id": "681"
      },
      {
        "title": "实战篇 2：小程序云的介绍与使用",
        "xcid": "14",
        "id": "682"
      },
      {
        "title": "实战篇 3：通过小程序云搭建电商后台服务",
        "xcid": "14",
        "id": "683"
      },
      {
        "title": "实战篇 4：商品列表页开发及性能优化",
        "xcid": "14",
        "id": "684"
      },
      {
        "title": "实战篇 5：商品详情页面开发",
        "xcid": "14",
        "id": "685"
      },
      {
        "title": "实战篇 6：购物车开发",
        "xcid": "14",
        "id": "686"
      },
      {
        "title": "实战篇 7：结算页面开发",
        "xcid": "14",
        "id": "687"
      },
      {
        "title": "实战篇 8：微信小程序端用户授权处理",
        "xcid": "14",
        "id": "688"
      },
      {
        "title": "实战篇 9：微信小程序开发填坑指南",
        "xcid": "14",
        "id": "689"
      },
      {
        "title": "实战篇 10：微信小程序端及 H5 端预览适配与发布",
        "xcid": "14",
        "id": "690"
      },
      {
        "title": "实战篇 11：React Native 端打包与发布",
        "xcid": "14",
        "id": "692"
      },
      {
        "title": "总结",
        "xcid": "14",
        "id": "693"
      },
      {
        "title": "开篇：微信小程序概述",
        "xcid": "8",
        "id": "700"
      },
      {
        "title": "基础篇 1：小程序开发基础知识",
        "xcid": "8",
        "id": "701"
      },
      {
        "title": "基础篇 2：小程序云开发基础知识",
        "xcid": "8",
        "id": "702"
      },
      {
        "title": "基础篇 3：小程序架构及其实现机制",
        "xcid": "8",
        "id": "703"
      },
      {
        "title": "实战篇 1：小程序开发环境搭建",
        "xcid": "8",
        "id": "704"
      },
      {
        "title": "实战篇 2：新鲜天气小程序简介",
        "xcid": "8",
        "id": "705"
      },
      {
        "title": "实战篇 3：天气页面样式布局开发",
        "xcid": "8",
        "id": "706"
      },
      {
        "title": "实战篇 4：天气页面数据获取和交互实现",
        "xcid": "8",
        "id": "707"
      },
      {
        "title": "实战篇 5：为天气页面制作雨雪效果的粒子系统",
        "xcid": "8",
        "id": "708"
      },
      {
        "title": "实战篇 6：心情签到页面开发",
        "xcid": "8",
        "id": "709"
      },
      {
        "title": "实战篇 7：对小程序进行优化",
        "xcid": "8",
        "id": "710"
      },
      {
        "title": "实战篇 8：小程序调试技巧和上线发布",
        "xcid": "8",
        "id": "711"
      },
      {
        "title": "总结与拓展",
        "xcid": "8",
        "id": "712"
      },
      {
        "title": "为什么选择 npm script",
        "xcid": "9",
        "id": "720"
      },
      {
        "title": "入门篇 01 创建并运行 npm script 命令",
        "xcid": "9",
        "id": "721"
      },
      {
        "title": "入门篇 02 运行多个 npm script 的各种姿势",
        "xcid": "9",
        "id": "722"
      },
      {
        "title": "入门篇 03 给 npm script 传递参数和添加注释",
        "xcid": "9",
        "id": "723"
      },
      {
        "title": "进阶篇 01 使用 npm script 的钩子",
        "xcid": "9",
        "id": "724"
      },
      {
        "title": "进阶篇 02 在 npm script 中使用环境变量",
        "xcid": "9",
        "id": "725"
      },
      {
        "title": "进阶篇 03 实现 npm script 命令自动补全",
        "xcid": "9",
        "id": "726"
      },
      {
        "title": "高阶篇 01 实现 npm script 跨平台兼容",
        "xcid": "9",
        "id": "727"
      },
      {
        "title": "高阶篇 02 把庞大的 npm script 拆到单独文件中",
        "xcid": "9",
        "id": "728"
      },
      {
        "title": "高阶篇 03 用 nodejs 脚本替代复杂的 npm script",
        "xcid": "9",
        "id": "729"
      },
      {
        "title": "实战篇 01 监听文件变化并自动运行 npm script",
        "xcid": "9",
        "id": "731"
      },
      {
        "title": "实战篇 02 结合 live-reload 实现自动刷新",
        "xcid": "9",
        "id": "732"
      },
      {
        "title": "实战篇 03 在 git hooks 中运行 npm script",
        "xcid": "9",
        "id": "733"
      },
      {
        "title": "实战篇 04 用 npm script 实现构建流水线",
        "xcid": "9",
        "id": "734"
      },
      {
        "title": "实战篇 05 用 npm script 实现服务自动化运维",
        "xcid": "9",
        "id": "735"
      },
      {
        "title": "开篇：Vuejs 的精髓——组件",
        "xcid": "12",
        "id": "800"
      },
      {
        "title": "基础：Vuejs 组件的三个 API：prop、event、slot",
        "xcid": "12",
        "id": "801"
      },
      {
        "title": "组件的通信 1：provide   inject",
        "xcid": "12",
        "id": "802"
      },
      {
        "title": "组件的通信 2：派发与广播——自行实现 dispatch 和 broadcast 方法",
        "xcid": "12",
        "id": "803"
      },
      {
        "title": "实战 1：具有数据校验功能的表单组件——Form",
        "xcid": "12",
        "id": "804"
      },
      {
        "title": "组件的通信 3：找到任意组件实例——findComponents 系列方法",
        "xcid": "12",
        "id": "805"
      },
      {
        "title": "实战 2：组合多选框组件——CheckboxGroup & Checkbox",
        "xcid": "12",
        "id": "806"
      },
      {
        "title": "Vue 的构造器extend 与手动挂载$mount",
        "xcid": "12",
        "id": "807"
      },
      {
        "title": "实战 3：动态渲染 点vue 文件的组件—— Display",
        "xcid": "12",
        "id": "808"
      },
      {
        "title": "实战 4：全局提示组件——$Alert",
        "xcid": "12",
        "id": "809"
      },
      {
        "title": "更灵活的组件：Render 函数与 Functional Render",
        "xcid": "12",
        "id": "810"
      },
      {
        "title": "实战 5：可用 Render 自定义列的表格组件——Table",
        "xcid": "12",
        "id": "811"
      },
      {
        "title": "实战 6：可用 slot-scope 自定义列的表格组件——Table",
        "xcid": "12",
        "id": "812"
      },
      {
        "title": "递归组件与动态组件",
        "xcid": "12",
        "id": "817"
      },
      {
        "title": "实战 7：树形控件——Tree",
        "xcid": "12",
        "id": "818"
      },
      {
        "title": "拓展：Vuejs 容易忽略的 API 详解",
        "xcid": "12",
        "id": "819"
      },
      {
        "title": "拓展：Vuejs 面试、常见问题答疑",
        "xcid": "12",
        "id": "820"
      },
      {
        "title": "拓展：如何做好一个开源项目（上篇）",
        "xcid": "12",
        "id": "821"
      },
      {
        "title": "拓展：如何做好一个开源项目（下篇）",
        "xcid": "12",
        "id": "822"
      },
      {
        "title": "写在最后",
        "xcid": "12",
        "id": "823"
      },
      {
        "title": "准备：简历编写和面试前准备",
        "xcid": "13",
        "id": "830"
      },
      {
        "title": "一面 1：ES 基础知识点与高频考题解析",
        "xcid": "13",
        "id": "831"
      },
      {
        "title": "一面 2：JS-Web-API 知识点与高频考题解析",
        "xcid": "13",
        "id": "832"
      },
      {
        "title": "一面 3：CSS-HTML 知识点与高频考题解析",
        "xcid": "13",
        "id": "833"
      },
      {
        "title": "一面 4：从容应对算法题目",
        "xcid": "13",
        "id": "834"
      },
      {
        "title": "一面 5：浏览器相关知识点与高频考题解析",
        "xcid": "13",
        "id": "835"
      },
      {
        "title": "一面 6：开发环境相关知识点与高频考题解析",
        "xcid": "13",
        "id": "836"
      },
      {
        "title": "二面 1：如何回答常见的软技能问题",
        "xcid": "13",
        "id": "837"
      },
      {
        "title": "二面 2：如何介绍项目及应对项目细节追问",
        "xcid": "13",
        "id": "838"
      },
      {
        "title": "HR 面：谈钱不伤感情",
        "xcid": "13",
        "id": "839"
      },
      {
        "title": "其他：面试注意事项",
        "xcid": "13",
        "id": "840"
      },
      {
        "title": "总结与补充说明",
        "xcid": "13",
        "id": "841"
      }
    ]
    let datas = [];
     ml.map((item,index)=>{
       if(item.xcid == options.aid){
         datas.push(item)
       }
    })
    console.log(datas)
    this.setData({
      listData:datas
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})